const initialPortfolioData = [
    {
        name: "Хакатон. Лендинг для HR Яндекс.Практикума",
        link: "https://loner789.github.io/hackathon-design-web/",
        description: "Хакатон. Разработка и создание лендинга для HR Яндекс.Практикума в составе команды из 3-х дизайнеров и 3-х разработчиков.",
        functional: "Сайт сверстан по технологиям HTML, CSS и JavaScript. Адаптивная верстка: от экрана Desctop (1440px) до Mobile (320px). Использованы flex и grid элементы, iframe для видео и сторонние библиотеки для эфектов (swiper). Сайт cверстан по BEM и собран с помощью Webpack",
    },
    {
        name: "Pet-проект Pomodoro timer",
        link: "https://vladimirivancha.github.io/pomodoro-timer/",
        description: "Одностраничное приложение таймера обратного отсчета по системе Pomodoro Technique.",
        functional: "Приложение создано на React.js с функциональными компонентами. Одностраничное приложение таймера обратного отсчета по технике Pomodoro Technique, заключающейся в интенсивной работе в течении 25 мин и отдыха в течении 5 мин с последующим повторением до 5 циклов работы. Реализована возможность переходить отдельно на таймер работы и таймер отдыха, а также в качестве бонуса на таймер StopWatch, в котором через установки можно самостоятельно задать интервал времени. Использована адаптивная Flexbox верстка, встроенные хуки UseState и UseEffect, а также сторонний кастомный хук useSound.",
    },
    {
        name: "Pet-проект Cool Colours",
        link: "https://vladimirivancha.github.io/cool-colours/",
        description: "Одностраничный сайт с генерацией 5-ти рандомных цветов из всей палитры hex цветов.",
        functional: "Возможность генерации 5-ти рандомных цветов по нажатию на клавишу 'пробел'. Возможность зафиксировать/расфиксировать понравившийся цвет и продолжить генерацию других. Возможность скопировать цвет в буфер обмена по клику на его номер. Возможность сохранить номера всех 5-ти выбранных цветов через хеш в адресной строке, отправить выбранную палитру другому человеку в виде адресной строки, при вводе которой другой человек видит выбранные цвета.",
    },
    {
        name: "Cайт о путешествиях по России",
        link: "https://vladimirivancha.github.io/russian-travel/",
        description: "Одностраничный сайт о путешествии по России. Знакомит с помощью фотографий и описывает впечатляющие места на территории России, которые можно посетить всей семьей с минимальными затратами.",
        functional: "Сверстан по правилам Nested БЭМ, содержит flexbox и grid элементы, используются анимация и переходы.",
    },
    // {
    //     name: "",
    //     link: "",
    //     description: "",
    //     functional: "",
    // }
];

export {
    initialPortfolioData,
};